app/controllers/high_scores_controller.rb

  def index
    @high_scores = HighScore.all
---
SELECT "high_scores".* FROM "high_scores"

  def create
    @high_score = HighScore.new(high_score_params)

    if @high_score.save
---
INSERT INTO "high_scores" ("created_at", "name", "score", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-19 02:17:55.879742"], ["name", "matt"], ["score", 28], ["updated_at", "2014-12-19 02:17:55.879742"]]